avr-rust/avrd/packs/xmegaa/ATxmega192A3U.atdf
        <register caption="Control Register C" name="CTRLC" offset="0x02" size="1">
          <bitfield caption="Reference Select" mask="0x18" name="REFSEL" values="DAC_REFSEL"/>
          <bitfield caption="Left-adjust Result" mask="0x01" name="LEFTADJ"/>
        </register>
        <register caption="Event Input Control" name="EVCTRL" offset="0x03" size="1">
          <bitfield caption="Separate Event Channel Input for Channel 1" mask="0x08" name="EVSPLIT"/>
          <bitfield caption="Event Input Selection" mask="0x07" name="EVSEL" values="DAC_EVSEL"/>
        </register>
        <register caption="Status" name="STATUS" offset="0x05" size="1">
          <bitfield caption="Channel 1 Data Register Empty" mask="0x02" name="CH1DRE"/>
          <bitfield caption="Channel 0 Data Register Empty" mask="0x01" name="CH0DRE"/>
        </register>
        <register caption="Gain Calibration" name="CH0GAINCAL" offset="0x08" size="1">
          <bitfield caption="Gain Calibration" mask="0x7F" name="CH0GAINCAL"/>
        </register>
        <register caption="Offset Calibration" name="CH0OFFSETCAL" offset="0x09" size="1">
          <bitfield caption="Offset Calibration" mask="0x7F" name="CH0OFFSETCAL"/>
        </register>
        <register caption="Gain Calibration" name="CH1GAINCAL" offset="0x0A" size="1">
          <bitfield caption="Gain Calibration" mask="0x7F" name="CH1GAINCAL"/>
        </register>
        <register caption="Offset Calibration" name="CH1OFFSETCAL" offset="0x0B" size="1">
          <bitfield caption="Offset Calibration" mask="0x7F" name="CH1OFFSETCAL"/>
        </register>
        <register caption="Channel 0 Data" name="CH0DATA" offset="0x18" size="2"/>
        <register caption="Channel 1 Data" name="CH1DATA" offset="0x1A" size="2"/>
      </register-group>
      <value-group caption="Output channel selection" name="DAC_CHSEL">
        <value caption="Single channel operation (Channel 0 only)" name="SINGLE" value="0x00"/>
        <value caption="Single channel operation (Channel 1 only)" name="SINGLE1" value="0x01"/>
        <value caption="Dual channel operation (Channel 0 and channel 1)" name="DUAL" value="0x02"/>
      </value-group>
      <value-group caption="Reference voltage selection" name="DAC_REFSEL">
        <value caption="Internal 1V " name="INT1V" value="0x00"/>
        <value caption="Analog supply voltage" name="AVCC" value="0x01"/>
        <value caption="External reference on AREF on PORTA" name="AREFA" value="0x02"/>
        <value caption="External reference on AREF on PORTB" name="AREFB" value="0x03"/>
      </value-group>
      <value-group caption="Event channel selection" name="DAC_EVSEL">
        <value caption="Event Channel 0" name="0" value="0x00"/>
        <value caption="Event Channel 1" name="1" value="0x01"/>
        <value caption="Event Channel 2" name="2" value="0x02"/>
        <value caption="Event Channel 3" name="3" value="0x03"/>
        <value caption="Event Channel 4" name="4" value="0x04"/>
        <value caption="Event Channel 5" name="5" value="0x05"/>
        <value caption="Event Channel 6" name="6" value="0x06"/>
        <value caption="Event Channel 7" name="7" value="0x07"/>
      </value-group>
    </module>
    <module name="RTC" id="I6093" caption="Real-Time Counter">
      <register-group caption="Real-Time Counter" name="RTC" size="14">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Prescaling Factor" mask="0x07" name="PRESCALER" values="RTC_PRESCALER"/>
        </register>
        <register caption="Status Register" name="STATUS" offset="0x01" size="1">
          <bitfield caption="Synchronization Busy Flag" mask="0x01" name="SYNCBUSY"/>
        </register>
        <register caption="Interrupt Control Register" name="INTCTRL" offset="0x02" size="1">
          <bitfield caption="Compare Match Interrupt Level" mask="0x0C" name="COMPINTLVL" values="RTC_COMPINTLVL"/>
          <bitfield caption="Overflow Interrupt Level" mask="0x03" name="OVFINTLVL" values="RTC_OVFINTLVL"/>
        </register>
        <register caption="Interrupt Flags" name="INTFLAGS" offset="0x03" size="1">
          <bitfield caption="Compare Match Interrupt Flag" mask="0x02" name="COMPIF"/>
          <bitfield caption="Overflow Interrupt Flag" mask="0x01" name="OVFIF"/>
        </register>
        <register caption="Temporary register" name="TEMP" offset="0x04" size="1"/>
        <register caption="Count Register" name="CNT" offset="0x08" size="2"/>
        <register caption="Period Register" name="PER" offset="0x0A" size="2"/>
        <register caption="Compare Register" name="COMP" offset="0x0C" size="2"/>
      </register-group>
      <value-group caption="Prescaler Factor" name="RTC_PRESCALER">
        <value caption="RTC Off" name="OFF" value="0x00"/>
        <value caption="RTC Clock" name="DIV1" value="0x01"/>
        <value caption="RTC Clock / 2" name="DIV2" value="0x02"/>
        <value caption="RTC Clock / 8" name="DIV8" value="0x03"/>
        <value caption="RTC Clock / 16" name="DIV16" value="0x04"/>
        <value caption="RTC Clock / 64" name="DIV64" value="0x05"/>
        <value caption="RTC Clock / 256" name="DIV256" value="0x06"/>
        <value caption="RTC Clock / 1024" name="DIV1024" value="0x07"/>
      </value-group>
      <value-group caption="Compare Interrupt level" name="RTC_COMPINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Overflow Interrupt level" name="RTC_OVFINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
